In [18]:
'''
Data Preprocessing is a crucial step in Machine Learning that helps enhance the quality of data to promote the extractions of meaningful insights from the data.

Steps of data preprocessing are:

1.Acquire the dataset

2.Import all the cruicial libraries

3.Import the dataset

4.Extract the independent variables

5.Extract the dependent variables

6.Identifyng and handling missing values

7.Encoding the categorical data

8.Splitting the dataset

9.Feature Scaling
'''

'\nData Preprocessing is a crucial step in Machine Learning that helps enhance the quality of data to promote the extractions of meaningful insights from the data.\n\nSteps of data preprocessing are:\n\n1.Acquire the dataset\n\n2.Import all the cruicial libraries\n\n3.Import the dataset\n\n4.Extract the independent variables\n\n5.Extract the dependent variables\n\n6.Identifyng and handling missing values\n\n7.Encoding the categorical data\n\n8.Splitting the dataset\n\n9.Feature Scaling\n'

In [1]:
import numpy as np
import pandas as pd

In [4]:
df=pd.read_csv('Exercise.csv')
df

      Name   Age   Salary
0  Brijesh  44.0  72000.0
1     Ravi  27.0  48000.0
2    Mukul   NaN  54000.0
3    Rohit  38.0  61000.0
4     Ajay  40.0      NaN
5    Rajat  35.0  58000.0
6    Priya   NaN  52000.0
7   Shikha  48.0  79000.0

In [3]:
df.shape

(8, 3)

In [5]:
df.isnull().sum()

Name      0
Age       2
Salary    1
dtype: int64

In [10]:
X=df.iloc[:,1:3]
X

    Age   Salary
0  44.0  72000.0
1  27.0  48000.0
2   NaN  54000.0
3  38.0  61000.0
4  40.0      NaN
5  35.0  58000.0
6   NaN  52000.0
7  48.0  79000.0

In [25]:
from sklearn.impute import SimpleImputer
si=SimpleImputer(missing_values=np.nan,strategy='mean')
imputer=imputer.fit(X)
X=imputer.transform(X)
X

array([[4.40000000e+01, 7.20000000e+04],
       [2.70000000e+01, 4.80000000e+04],
       [3.86666667e+01, 5.40000000e+04],
       [3.80000000e+01, 6.10000000e+04],
       [4.00000000e+01, 6.05714286e+04],
       [3.50000000e+01, 5.80000000e+04],
       [3.86666667e+01, 5.20000000e+04],
       [4.80000000e+01, 7.90000000e+04]])